//Beep()函数，头文件windows.h
//函数内容(赫兹，持续时间)
#include<stdio.h>
#include<windows.h>
typedef struct
{
	int freq; //赫兹
	int duration;//持续时间
	char text[32];//文本内容
}STU;
STU t[]=
{{784, 375, "祝"}, {784, 125, "你"}, {880, 500, "生"}, {784, 500, "日"}, {1046, 500, "快"}, {988, 1000, "乐\n"},
{784, 375, "祝"}, {784, 125, "你"}, {880, 500, "生"}, {784, 500, "日"}, {1175, 500, "快"},
{1046, 1000, "乐\n"}, {784, 375, "祝"}, {784, 125, "你"}, {1568, 500, "生"}, {1318, 500, "日"},
{1046, 500, "快"}, {988, 500, "乐\n"}, {880, 500, ""}, {1397, 375, "祝"}, {1397, 125, "你"},
{1318, 500, "生"}, {1046, 500, "日"}, {1175, 500, "快"}, {1046, 1000, "乐\n"}, };
int main()
{
	int i;
	//printf("%d  %d",sizeof(t),sizeof(STU));
	//结构体数组的长度sizeof(t)/sizeof(STU)得到，总结构体数组大小 / 单个结构体大小
	for (i=0; i<sizeof(t)/sizeof(STU); i++)
	{
		printf("%s",t[i].text);
		Beep(t[i].freq,t[i].duration);
	}
	return 0;
}
